Repository: 84000/data-translation-memory
Catalog: Toh_273-The_Twelve_Buddhas-v2.tmx
Source language: bo
Languages: en

source: འཕགས་པ་སངས་རྒྱས་བཅུ་གཉིས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Mahāyāna Sūtra The Twelve Buddhas

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: The Blessed One was residing on Vulture Peak at Rājagṛha with a great saṅgha of one thousand two hundred and fifty monks and

source: བྱང་ཆུབ་སེམས་དཔའ་མ་ཕམ་པ་ལ་སོགས་པ། བྱང་ཆུབ་སེམས་དཔའ་ཁྲི་ཉིས་སྟོང་གི་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ཆེན་པོ་དང་ཡང་ཐབས་ཅིག་གོ །
en: a great saṅgha of twelve thousand bodhisattvas that included the bodhisattva Ajita and others.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ལ་བཀའ་སྩལ་པ།
en: The Blessed One addressed the bodhisattva great being Maitreya, saying,

source: བྱམས་པ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ཤར་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་བརྗོད་དུ་མེད་པ་བཅུའི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་མུ་ཏིག་ཅན་ཞེས་བྱ་བ་ཡོད་དེ
en: “Maitreya, to the east of this buddhafield, past as many buddhafields as there are grains of dust in ten inexpressible billions of buddhafields, there is a world system called Full of Pearls.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནམ་མཁའི་དཔལ་དྲི་མེད་རྡུལ་སེལ་རབ་མཛེས་ཡོན་ཏན་གྱི་ཏོག་གི་འོད་མེ་ཏོག་པད་མ་བཻ་དཱུརྱའི་འོད་ཟེར་རིན་པོ་ཆེའི་གཟུགས་ལྟ་བུའི་སྐུ་དང་ལྡན་པ་སྤོས་མཆོག་དམ་པས་མཆོད་པ་སྐུ་རྣམ་པར་སྤྲས་ཤིང་ལེགས་པར་བརྒྱན་པ་གཙུག་ཏོར་གྱི་གཙུག་ནས་ཉི་མའི་འོད་ཟེར་དཔག་མེད་ཟླ་འོད་སྨོན་ལམ་གྱིས་བརྒྱན་པ་རབ་སྤྲུལ་བཀོད་པ་ཆེན་པོ་ཆོས་ཀྱི་དབྱིངས་ལས་མངོན་འཕགས་ཆགས་མེད་རིན་ཆེན་རྒྱལ་པོ་ཞེས་བྱ་བ་ད་ལྟར་ཡང་བཞུགས་ཏེ་
en: In that buddhafield there is a tathāgata, arhat, completely perfect buddha named King of Jewels Devoid of Desire Whose Supreme Emanation Has Arisen from the Expanse of Phenomena, Who Is Ornamented by Boundless Sunlight from the Top of His Crown Protuberance and by an Aspiration Like Moonlight, Whose Body Is Bedecked and Elegantly Ornamented with Offerings of Excellent Perfumes, Who Has a Body Like a Lotus Flower Lovely as a Resplendent Blue Beryl Gemstone, the Light of the Good Qualities of Whom Are as Beautiful as a Glorious Pure Sky Free of Dust.

source: འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: He nurtures and teaches the Dharma to the beings who live there.

source: སུ་རྒྱལ་བའི་མཚན་འཛིན་པ་དེ་བསྐལ་པ་ཆེན་པོ་འཛམ་བུའི་གླིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་བསྐལ་པར་འཁོར་བ་ལས་ལྡོག་གོ། །
en: Whoever remembers the name of that victorious one will renounce cyclic existence for a great eon that consists of eons equal to the number of grains of dust in Jambudvīpa.

source: !དེས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དྲི་མེད་ཅེས་བྱ་བ་ལུང་བསྟན་ཏེ།
en: “That tathāgata issued the following prophecy about the bodhisattva great being Incomparable:

source: དེ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནམ་མཁའི་དཔལ་དྲི་མེད་རྡུལ་སེལ་རབ་མཛེས་ཡོན་ཏན་གྱི་ཏོག་གི་འོད་མེ་ཏོག་པད་མ་བཻ་དཱུརྱའི་འོད་ཟེར་རིན་པོ་ཆེའི་གཟུགས་ལྟ་བུའི་སྐུ་དང་ལྡན་པ་སྤོས་མཆོག་དམ་པས་མཆོད་པ་སྐུ་རྣམ་པར་སྤྲས་ཤིང་ལེགས་པར་བརྒྱན་པ་གཙུག་ཏོར་གྱི་གཙུག་ནས་ཉི་མའི་འོད་ཟེར་དཔག་མེད་ཟླ་འོད་སྨོན་ལམ་གྱིས་བརྒྱན་པ་རབ་སྤྲུལ་བཀོད་པ་ཆེན་པོ་ཆོས་ཀྱི་དབྱིངས་ལས་མངོན་འཕགས་ཆགས་མེད་རིན་ཆེན་རྒྱལ་པོ་དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་དམ་པའི་ཆོས་ནུབ་མ་ཐག་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ
en: “ ‘As soon as the tathāgata, arhat, perfect and complete buddha King of Jewels Devoid of Desire Whose Supreme Emanation Has Arisen from the Expanse of Phenomena, Who Is Ornamented by Boundless Sunlight from the Top of His Crown Protuberance and by an Aspiration Like Moonlight, Whose Body Is Bedecked and Elegantly Ornamented with Offerings of Excellent Perfumes, Who Has a Body Like a Lotus Flower Lovely as a Resplendent Blue Beryl Gemstone, the Light of the Good Qualities of Whom Are as Beautiful as a Glorious Pure Sky Free of Dust passes into parinirvāṇa and his teachings fade away, the bodhisattva Incomparable will attain unsurpassed, perfect, completely manifest awakening.

source: !དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཆུ་ལྷ་གཞོན་ནུ་ཉི་མའི་སྒྲོན་མ་ཟླ་བའི་མེ་ཏོག་རིན་ཆེན་པད་མ་གསེར་སྡུག་ནམ་མཁའ་ལྟ་བུའི་སྐུ་ལྡན་རྣམ་པར་སྣང་མཛད་འོད་ཟེར་རབ་བརྒྱན་ཐོགས་མེད་འཁོར་ལོའི་དཀྱིལ་འཁོར་ཕྱོགས་བཅུར་འོད་ཟེར་རབ་འབྱིན་འཇིག་རྟེན་ཁམས་ཀུན་ཏུ་སྣང་བྱེད་ཏོག་གི་རྒྱལ་མཚན་རྒྱལ་པོ་ཞེས་བྱ་བར་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །
en: He will appear in the world as a tathāgata, arhat, perfect and complete buddha endowed with perfect knowledge and conduct, a sugata, a knower of the world, an unsurpassed guide who tames beings, a teacher of gods and humans known as the blessed buddha Victory Banner King Whose Light Rays Illuminate All the World Realms in the Ten-Directional Unimpeded Circular Maṇḍala, Adorned with Completely Illuminating Sunlight, Endowed with a Space-Like Body Resembling Youthful Varuna, the Light of the Sun, a Moon Flower, and a Beautiful Golden Lotus.’

source: ཤར་ཕྱོགས་དེ་ཉིད་ཀྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཀོད་པ་ཐམས་ཅད་དྲི་མེད་འོད་ཅེས་བྱ་བའི་མཚན་ཀྱང་གཟུང་ངོ་། །
en: “You should also remember the name of the tathāgata, arhat, perfect and complete buddha of the quarter to the east from there called Stainless Light of the Entire Array, and

source: ཚིག་འདོན་ཏོ། །ཕྱག་བྱའོ། །
en: you should recite it and prostrate to him.

source: ལྷོ་ཕྱོགས་ཀྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྤོབས་པའི་རྒྱན་ལ་དགོངས་པ་ཞེས་བྱ་བའི་མཚན་ཀྱང་གཟུང་ངོ་། །ཡིད་ལ་བྱའོ། །
en: You should also remember the name of the tathāgata, arhat, perfect and complete buddha of the southern quarter called Thought Adorned with Eloquence, and you should direct your attention toward him.

source: ནུབ་ཕྱོགས་ཀྱི་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་ཟླ་བའི་ཏོག་གི་རྒྱལ་པོ་གྲགས་ལྡན་ཞེས་བྱ་བའི་མཚན་ཀྱང་གཟུང་ངོ་། །ཕྱག་བྱའོ། །
en: You should also remember the name of the tathāgata of the western quarter called Renowned Victor Crowned with a Clear Moon, and you should prostrate to him.

source: བྱང་ཕྱོགས་ཀྱི་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་གི་བཀོད་པ་སྣང་བར་མཛད་པ་ཞེས་བྱ་བའི་མཚན་ཀྱང་གཟུང་ངོ་། །ཕྱག་བྱའོ། །
en: You should also remember the name of the tathāgata of the northern quarter Manifesting an Array of Flowers, and you should prostrate to him.

source: ཤར་ལྷོའི་ཕྱོགས་མཚམས་ཀྱི་དེ་བཞིན་གཤེགས་པ་འོད་མཛད་ཅེས་བྱ་བའི་མཚན་ཀྱང་གཟུང་ངོ་། །ཕྱག་བྱའོ། །
en: You should also remember the name of the tathāgata of the southeastern quarter called Light Maker, and you should prostrate to him.

source: ལྷོ་ནུབ་ཀྱི་ཕྱོགས་མཚམས་ཀྱི་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་མཆོག་གི་ཏོག་གྲགས་ལྡན་ཞེས་བྱ་བའི་མཚན་ཀྱང་གཟུང་ངོ་། །ཕྱག་བྱའོ། །
en: You should also remember the name of the tathāgata of the southwestern quarter called Renowned Supreme Jewel Crown, and you should prostrate to him.

source: ནུབ་བྱང་གི་ཕྱོགས་མཚམས་ཀྱི་དེ་བཞིན་གཤེགས་པ་འཇིགས་མེད་རྣམ་པར་གཟིགས་ཞེས་བྱ་བའི་མཚན་ཀྱང་གཟུང་ངོ་། །ཕྱག་བྱའོ། །
en: You should also remember the name of the tathāgata of the northwestern quarter called Fearless and All-Seeing, and you should prostrate to him.

source: བྱང་ཤར་གྱི་ཕྱོགས་མཚམས་ཀྱི་དེ་བཞིན་གཤེགས་པ་འཇིགས་བྲལ་བག་ཚ་བ་མི་མངའ་སྤུ་ཟིང་མི་བྱེད་ཅེས་བྱ་བའི་མཚན་ཀྱང་གཟུང་ངོ་། །ཕྱག་བྱའོ། །
en: You should also remember the name of the tathāgata of the northeast quarter called Bristling with Fearless Confidence, and you should prostrate to him.

source: འོག་གི་ཕྱོགས་ཀྱི་དེ་བཞིན་གཤེགས་པ་སེང་གེ་བསྒྱིངས་པའི་མིད་པ་ཞེས་བྱ་བའི་མཚན་ཀྱང་གཟུང་ངོ་། །ཕྱག་བྱའོ། །
en: You should also remember the name of the tathāgata of the nadir called Throat of the Yawning Lion, and you should prostrate to him.

source: སྟེང་གི་ཕྱོགས་ཀྱི་དེ་བཞིན་གཤེགས་པ་གསེར་འོད་གཟི་བརྗིད་འཇིགས་བྲལ་རྒྱལ་པོ་ཞེས་བྱ་བའི་མཚན་ཀྱང་གཟུང་ངོ་། །ཕྱག་བྱའོ། །
en: You should also remember the name of the tathāgata of the zenith called Fearless King Majestic Golden Radiance, and you should prostrate to him.

source: བྱམས་པ་དད་པའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཅུ་གཉིས་པོ་འདི་དག་གི་མཚན་བརྗོད་ལ། ཉི་མ་བཅུར་སྡིག་པ་ཐམས་ཅད་ཀྱི་ཉེས་པ་བཤགས་པར་བྱ།
en: “Maitreya, sons or daughters of the lineage with sincere faith should recite the names of these twelve tathāgata, arhat, perfect and complete buddhas, and over the course of ten days as they confess all their misdeeds,

source: དགེ་བའི་རྩ་བ་ཐམས་ཅད་ལ་རྗེས་སུ་ཡི་རང་བར་བྱ།
en: they should rejoice in all roots of virtue.

source: སངས་རྒྱས་ཐམས་ཅད་ལ་བསྐུལ་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ལ་གསོལ་བ་གདབ་པ་དང་། དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཆོས་ཀྱི་དབྱིངས་སུ་ཡོངས་སུ་བསྔོ་བས་ཡོངས་སུ་བསྔོ་བར་བྱའོ། །
en: They should make requests to all the buddhas, supplicate all the buddhas, and dedicate all these roots of virtue by dedication to the expanse of phenomena.

source: འོན་ཀྱང་སྡིག་པ་ཐམས་ཅད་ཟད་པར་འགྱུར་རོ། །
en: “All their misdeeds will be exhausted and

source: ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་བྱང་བར་འགྱུར་རོ། །
en: all their karmic obscurations will be purified.

source: དེའི་འོག་ཏུ་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཕུན་སུམ་ཚོགས་པ་དང་། མི་འཇིགས་པ་ཕུན་སུམ་ཚོགས་པ་དང་། མཚན་ཕུན་སུམ་ཚོགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ཕུན་སུམ་ཚོགས་པ་དང་། གཟུངས་ཕུན་སུམ་ཚོགས་པ་ཡང་འཐོབ་བོ། །
en: “Later, they will obtain the excellent conditions of a buddhafield with a vast array of good qualities, the excellent conditions of the fearlessnesses, the excellent conditions of the marks of an awakened being, the excellent conditions of a saṅgha of bodhisattvas, the excellent conditions of the dhāraṇīs, and

source: ཏིང་ངེ་འཛིན་ཕུན་སུམ་ཚོགས་པ་ཡང་འཐོབ་བོ། །
en: the excellent conditions of meditative concentrations.

source: བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ཕུན་སུམ་ཚོགས་པ་དང་། དགེ་བའི་བཤེས་གཉེན་ཕུན་སུམ་ཚོགས་པ་ཡང་མྱུར་དུ་ཡོངས་སུ་འཛིན་ཏོ། །
en: “In the immediate, they will have the support of the excellent conditions of a pure buddhafield in accordance with their aspirations, and the excellent conditions of a spiritual teacher.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཉམས་པར་མི་འགྱུར་ཞིང་ཡོངས་སུ་ཉམས་པར་ཡང་མི་འགྱུར་རོ། །
en: Their progress toward unsurpassed complete and perfect awakening will not fall back and will never be lost.

source: འཁོར་བ་ན་འཁོར་བའི་ཚེ་ཡང་ཀུན་ཏུ་མཛེས་པ་དང་། དེའི་ལོངས་སྤྱོད་ཕུན་སུམ་ཚོགས་པ་དང་། རིགས་ཕུན་སུམ་ཚོགས་པ་དང་། སྐྱེ་བ་ཕུན་སུམ་ཚོགས་པ་དང་། རུས་ཕུན་སུམ་ཚོགས་པ་དང་། གཟུགས་ཕུན་སུམ་ཚོགས་པ་དང་། རིས་འདྲ་བའི་སྐྱེ་བོའི་འཁོར་ཕུན་སུམ་ཚོགས་པ་ཡང་ཡོངས་སུ་འཛིན་ཏོ། །
en: As they take rebirth in cyclic existence, they will have the support of the excellent conditions of good looks and wealth, the excellent conditions of family line, the excellent conditions of social standing, the excellent conditions of family traits, the excellent conditions of appearance, and the excellent conditions of having a retinue of people around them who are of similar disposition.

source: དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ།
en: “On this topic, it is said:

source: གང་དང་གང་དུ་སྐྱེས་པ་ཡི། །ཚེ་རབས་ཚེ་རབས་ཐམས་ཅད་དུ། །མཐོང་ན་དགའ་ཞིང་དགའ་བྱེད་དང་། །འོད་བྱེད་པ་དང་མཐུ་ཆེན་དང་། །འབྱོར་པ་ཆེན་པོར་འགྱུར་བ་ཡིན། །
en: “In all lifetimes, No matter where they are reborn, They will be a joyful sight, a bringer of joy, Radiant, have great influence, And have abundant wealth.

source: གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་རྣམས་ཀྱང་བརྗོད་པར་བྱའོ། །
en: “They should recite the mantra words of this dhāraṇī:

source: !ཏདྱ་ཐཱ། ཨ་ཁེ། མ་ཁེ། ས་མན་ཏ་མུ་ཁེ། སཽ་ཏི། ཡུག་ཏེ། ནི་རུག་ཏེ། པྲ་བྷེ་ས་མ་ཡོ་གེ། ཙི་ཏ་བི་བརྟེ། ཨ་མེ། ཁ་མེ། མ་ད་ནེ། བི་བརྟེ། ས་མན་ཏ་གུ་ཎེ། ས་ཏྱ་ར་མེ། ཡུག་ཏེ། པྲ་ཡུག་ཏེ། ཧི་ལི་མི་ལི། མ་ས་ལེ། ཨཱ་ན་ལེ། ཙ་མེ་ཨ་ཙི་ཊི། ཨ་ཙི་ཊི། ཙོ་ཙེ། ཨ་ར་ཧེ། བ་ཧུད་ཚེ། མཱ་ཡུ་གྲ་ཧེ། ཧེ་མ་བ་ཏི། ཛྱོ་ཏི་བཏི། དྷ་རྨ་ཙི་ཏི། ཙྱུ་ཏ་བང་ཀེ། ཨ་བི་ཀྵེ་པེ། ར་དྷི་ཀྵ་མེ། སྐན་དྷ་བི་བྷ་ཀ་ཏེ།
en: tadyathā akhe makhe samanta­mukhe sautiyukte nirukte prabhe sama­yoge cita­vivarte ame khame madane vivarte samanta­guṇe satyārame yukte prayukte hili mili masale ānale came aciṭi aciṭi coce arahe bahudche māyugrahe hemavati jyotivati dharmaciti cyutapaṅke avikṣepe radhikṣa me skandha­vibhakte

source: སངས་རྒྱས་ཀྱི་བྱིན་གྱིས་བརླབས་ཀྱིས་གསང་སྔགས་ཀྱི་གཞི་འདི་རྣམས་གྲུབ་པར་གྱུར་ཅིག །
en: With the blessing of the Buddha, may these mantra words be accomplished.

source: གཟུངས་འདི་དག་ནི་བཟུང་བྱས་ན། །ཕྱོགས་བཅུ་དག་ན་གང་བཞུགས་པའི། །བྱེ་བ་དྲུག་ཅུའི་དྲང་སྲོང་རྣམས། །དེ་དག་དེ་ལ་དགོངས་པར་འགྱུར། །
en: “The six hundred million sages Who dwell in the ten directions Will pay heed to those Who bear these dhāraṇī verses in mind.

source: སྐྱེ་བ་དག་ནི་ཀུན་ཏུ་ཡང་། །དགེ་བའི་བཤེས་གཉེན་རྙེད་པར་འགྱུར། །
en: “In all their rebirths They will encounter a spiritual teacher, And

source: ཅུང་ཟད་དགེ་བ་གང་ཡིན་པ། །དོན་རྣམས་ཐམས་ཅད་འབྱོར་པར་འགྱུར། །
en: whatever little virtue they possess Will accomplish all their goals.

source: པད་མའི་སྙིང་པོར་བཞུགས་པ་ཡི། །སངས་རྒྱས་རྣམས་ནི་མངོན་དུ་མཐོང་། །
en: Will see the buddhas seated In the center of lotuses before them And

source: གཟུངས་འདི་དག་ནི་འཛིན་བྱེད་པ། །མཁས་པ་དཔལ་ལྡན་རྫུས་ཏེ་སྐྱེ། །
en: “Those who bear these dhāraṇī verses in mind be wise, fortunate, and take miraculous birth.

source: དྲན་དང་བློ་གྲོས་རྟོགས་པ་དང་། །མོས་དང་ཤེས་རབ་རབ་ཏུ་འཕེལ། །
en: “Their recollection, intellect, understanding, Devotion, and insight will increase.

source: ཐོས་པ་ཐམས་ཅད་འཛིན་པར་འགྱུར། །
en: They will understand all they have studied, And

source: ཐོས་པ་རྣམས་ནི་ཡོངས་མི་ཉམས། །
en: their understanding of all they have studied will not diminish.

source: འཇིག་རྟེན་མགོན་པོ་འདི་དག་གི །མཚན་རྣམས་སུ་ཞིག་རྗོད་བྱེད་པ། །ངན་འགྲོ་ཐམས་ཅད་སྤངས་ནས་ནི། །བཟང་འགྲོར་མྱུར་དུ་འགྲོ་བར་འགྱུར། །
en: “Those who recite the names Of these world protectors Will be free from all lower rebirths And quickly proceed to the higher realms;

source: ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་མཆོག །དེ་དག་དེ་ལ་མངོན་དུ་གྱུར། །
en: “There they will realize The supreme meditative concentrations and dhāraṇīs, And

source: བྱང་ཆུབ་རབ་ཏུ་དེ་འཚང་རྒྱ། །
en: they will attain supreme awakening.

source: ཞིང་ནི་བྱེ་བ་ཕྲག་སྟོང་དག །གསེར་གྱིས་བཀང་སྟེ་སྦྱིན་བྱིན་པས། །གང་གིས་དེ་བཞིན་གཤེགས་རྣམས་ཀྱི། །མཚན་རྣམས་འཛིན་པར་བྱེད་པ་ཡི། །བསོད་ནམས་ཕུང་པོ་དེ་ཆེས་མང་། །
en: Compared to filling a thousand million buddhafields “With gold and making offerings with it, Those who bear the names Of these tathāgatas in mind Will have a much greater heap of merit.

source: རྟག་ཏུ་ཚེ་རབས་དྲན་པར་འགྱུར། །
en: “They will always remember their past lives.

source: བྱང་ཆུབ་སྤྱད་པ་སྤྱོད་པའི་ཚེ། །མི་ཁོམ་ཐམས་ཅད་རྣམ་སྤངས་ཏེ། །
en: When they practice the conduct of a bodhisattva, They will abandon all unfree states, And

source: སངས་རྒྱས་འབྱུང་བ་རབ་མཛེས་བརྙེས། །
en: the exquisite emergence of buddhas is achieved.

source: རྫོགས་པའི་སངས་རྒྱས་མཉེས་པར་བྱེད། །
en: “They will serve the perfect buddhas.

source: དད་པ་བླ་ན་མེད་པ་འཐོབ། །
en: They will obtain unsurpassed faith.

source: སངས་རྒྱས་རྣམས་ལ་རབ་དད་ཅིང་། །མཆོད་པ་དམ་པ་བྱེད་པར་འགྱུར། །
en: They will express their faith in the buddhas And make supreme offerings to them.

source: སངས་རྒྱས་འབྱུང་བ་མཉེས་བྱེད་དེ། །
en: “Delighted by the emergence of buddhas,

source: མཐོང་ནས་སྟོན་ལ་རབ་ཏུ་དད། །
en: They shall see them and have faith in these teachers.

source: འཇིག་རྟེན་སྒྲོན་མ་མཐོང་ནས་ནི། །མཆོད་པ་བཟང་པོ་བྱེད་པར་འགྱུར། །
en: They will see these lamps that illuminate the world And make excellent offerings to them.

source: མཚན་རྣམས་འདི་དག་འཛིན་བྱེད་པ། །བསྐལ་པ་བྱེ་བ་གྲངས་མེད་དུ། །འཁོར་བ་རྣམ་པར་སྤངས་ནས་སུ། །བྱང་ཆུབ་མྱུར་དུ་འཚང་ཡང་རྒྱ། །
en: “Those who bear these names in mind Will be free from cyclic existence For innumerable millions of eons And quickly attain awakening.

source: ཉིན་ཞག་བདུན་དུ་ཚང་བར་ནི། །མཚན་རྣམས་འདི་དག་འཛིན་བྱེད་ན། །
en: “If they bear these names in mind For a total of seven days and nights,

source: གང་གིས་འདྲེན་རྣམས་མཐོང་འགྱུར་བའི། །རྒྱ་ཆེན་མིག་ནི་སྦྱངས་པར་འགྱུར། །
en: The extensive vision of whoever sees these guides Will be purified.

source: འཇིག་རྟེན་མགོན་པོ་དེ་དག་གི །མཚན་རྣམས་མི་གང་འཛིན་བྱེད་པ། །སྐྱེ་བ་གང་དང་གར་སྐྱེས་པར། །དེ་ནི་ཕྱག་བྱའི་འོས་སུ་འགྱུར། །
en: “Those who bear the names Of the world protectors in mind Will be worthy of veneration Wherever they might take rebirth.

source: མཚན་རྣམས་འདི་དག་འཛིན་བྱེད་པ། །བསྐལ་པ་བྱེ་བ་བསམ་ཡས་སུ། །བཀུར་སྟི་མ་ཡིན་འཐོབ་མི་འགྱུར། །
en: “Those who bear these names in mind Will not fall into disrepute For unimaginable millions of eons,

source: འཇིག་རྟེན་དག་ན་གྲགས་པ་འཐོབ། །
en: But will be famous throughout all worlds.

source: མཚན་རྣམས་འདི་དག་འཛིན་བྱེད་པ། །དེ་ལ་བསྐལ་པ་དུ་མར་ནི། །ལྷ་རྣམས་བསྟི་སྟང་བྱེད་པར་འགྱུར། །
en: “Those who bear these names in mind Will be honored by the gods For many eons And

source: བྱང་ཆུབ་མྱུར་དུ་འཚང་ཡང་རྒྱ། །
en: quickly attain awakening.

source: མཚན་རྣམས་འདི་དག་འཛིན་བྱེད་པ། །མོས་བྱེད་ཤེས་རབ་འཆལ་མི་འགྱུར། །
en: “Those who bear these names in mind Will not lack faith or lose insight,

source: གཡོ་དང་སྒྱུ་ནི་རྣམ་པར་སྤངས། །
en: Will give up deviation and deceit, And

source: རྟག་ཏུ་སངས་རྒྱས་རྣམས་ཀྱང་མཐོང་། །
en: will always see the buddhas.

source: མཚན་རྣམས་འདི་དག་འཛིན་བྱེད་པ། །ལྷ་དང་དྲི་ཟ་ཀླུ་དབང་དང་། །མཁའ་ལྡིང་ལྷ་མིན་གསང་བ་པ། །རྟག་ཏུ་དེ་ལ་སྲུང་བར་བྱེད། །
en: “Those who bear these names in mind Will always be protected By gods, gandharvas, the nāga lords, Garuḍas, asuras, and guhyakas.

source: གཟུགས་དང་མཚན་ནི་ཕུན་སུམ་ཚོགས། །ནོར་ཆེན་ཁྱིམ་དུ་སྐྱེ་བར་འགྱུར། །
en: “They will have excellent bodily forms and names And will be born into wealthy households.

source: སེམས་ཅན་ཀུན་ལ་སྦྱིན་པ་བྱེད། །
en: They will be generous to all beings And

source: དཔའ་ཞིང་གཏོང་ཕོད་སེར་སྣ་མེད། །
en: will be brave, magnanimous, and selfless.

source: བསྐལ་པ་བྱེ་བ་བརྒྱ་མང་པོར། །ལྷ་ཡི་ཙན་དན་དམར་པོ་དང་། །ཤིན་ཏུ་དྲི་ཞིམ་སྤོས་ཀུན་གྱི། །སྤོས་ངད་དེ་ཡི་ཁ་ནས་འབྱུང་། །
en: “For many millions of eons, They will always have the pleasant scent Of divine red sandalwood, And their breath will have the scent of perfume.

source: མཚན་རྣམས་འདི་དག་འཛིན་བྱེད་པ། །བསྐལ་པ་བྱེ་བར་སྒྲ་སྐད་ནི། །ཚངས་པའི་དབྱངས་དང་ལྡན་པར་འགྱུར། །
en: “Those who bear these names in mind Shall be endowed with the melodious voice of Brahmā For millions of eons And

source: རྟག་ཏུ་ཆོས་རྒྱལ་ཚུལ་དང་ལྡན། །
en: maintain the status of a Dharma king.

source: མཚན་རྣམས་འདི་དག་འཛིན་བྱེད་པ། །རིན་ཆེན་སྣ་བདུན་པད་མའི་འདབ། །བྱེ་བ་སྟོང་ཕྲག་མང་ཡོད་ལས། །འབྱོར་ཆེན་དེ་སྐྱེ་ལྷ་གཟུགས་ལྡན། །
en: “Those who bear these names in mind Will have divine bodies, And great riches will spring from the many-million petals Of the lotus of the seven royal treasures.

source: མཚན་རྣམས་འདི་དག་སུ་འཛིན་པ། །དེ་ནི་ཕ་མ་སྤུན་སྡུག་དང་། །སྐྱེ་བོ་དག་གི་ཚོགས་རྣམས་དང་། །འབྲལ་བར་འགྱུར་བ་མི་མཐོང་ངོ་། །
en: “Those who bear these names in mind Will never find themselves Without fathers, mothers, siblings, loved ones, And a multitude of good people.

source: དྲང་སྲོང་ཆེན་པོ་རྣམས་ཀྱི་མཚན། །བུད་མེད་ཀྱིས་ནི་བཟུང་བྱས་ན། །
en: “If a woman has borne the names Of these great sages in mind,

source: བུད་མེད་ལུས་ལ་མ་ཆགས་ནས། །སྐྱེས་པ་བློ་གྲོས་ལྡན་པར་འགྱུར། །
en: She will be freed from her feminine form And become an intelligent man.

source: མི་ཡི་ལུས་ནི་ཐོབ་གྱུར་ནས། །བླ་མེད་བྱང་ཆུབ་འཐོབ་འགྱུར་ཏེ། །
en: “After attaining the next human rebirth, She will attain unsurpassed awakening,

source: !ཆོས་ཀྱི་འཁོར་ལོ་རབ་བསྐོར་ནས། །འདོད་པ་ཇི་བཞིན་མྱ་ངན་འདའ། །
en: Turn the wheel of the Dharma, And easily attain nirvāṇa.

source: མཚན་རྣམས་འདི་དག་སུ་འཛིན་པ། །དེ་ཡི་ལུས་ལ་མཚོན་དང་ནི། །དུག་དང་མེ་དང་རྒྱལ་པོ་དང་། །གཡོན་ཅན་རྣམས་ཀྱིས་མི་ཚུགས་སོ། །
en: “Those who bear these names in mind Cannot be harmed By weapons, poison, Fire, kings, or criminals.

source: མཚན་རྣམས་འདི་དག་སུ་འཛིན་པ། །དེ་ཡི་སེམས་ལ་ནམས་ཀྱང་ནི། །དཔུང་དང་བཞོན་པར་བཅས་པ་ཡི། །བདུད་ཀྱིས་གླགས་རྙེད་མི་འགྱུར་རོ། །
en: “The thoughts of those Who bear these names in mind Will never be troubled By Māra, mounted on his chariot with his retinue.

source: འདི་དག་གི་ནི་མཚན་གྱི་རྣམས། །མི་གང་འཛིན་པར་བྱེད་པ་དེ། །ཞིང་ནི་བྱེ་བ་བསམ་ཡས་པར། །ནམ་མཁའ་ལས་ནི་འགྲོ་བར་འགྱུར། །
en: “Human beings who bear The names of these buddhas in mind Can course through space Across infinite millions of buddhafields.

source: སངས་རྒྱས་སྟོན་པ་རྣམས་མཆོད་ནས། །འཇིགས་པ་མེད་པར་ཞུ་བ་ཞུ། །
en: “After making offerings to the buddhas who teach there, They must fearlessly petition them.

source: དེ་དག་དེ་ཡི་བསམ་མཁྱེན་ནས། །རྒྱལ་བ་དེ་དག་ལུང་སྟོན་འགྱུར། །
en: The victors will understand their wishes And issue prophecies of their awakenings.

source: སངས་རྒྱས་མགོན་པོ་དེ་དག་ལས། །ལུང་བསྟན་པ་ནི་འཐོབ་གྱུར་ནས། །
en: “After they receive prophecies From those buddha lords,

source: དེ་ནི་ཤིན་ཏུ་ཡི་རངས་ཏེ། །རྒྱལ་བའི་བསྟན་ལ་ཐེ་ཙོམ་མེད། །
en: They will be exceedingly joyful And have no doubt in the Victor’s teaching.

source: མཚན་རྣམས་འདི་དག་འཛིན་བྱེད་པ། །འཇིག་རྟེན་མགོན་པོ་རྣམས་ལས་ནི། །ཟབ་མོའི་ཆོས་ནི་ཐོས་གྱུར་ཏེ། །
en: “Those who bear these names in mind Will hear the profound Dharma From all the world protectors And

source: ཐོས་ནས་ཐམས་ཅད་འཛིན་པར་འགྱུར། །
en: retain all they have heard.

source: དེ་ནས་ཕ་རོལ་ཕྱིན་པ་དང་། །མི་འཇིགས་པ་དང་སྟོབས་རྣམས་དང་། །མཚན་དང་དཔེ་བྱད་བཟང་པོ་རྣམས། །མ་ལུས་པར་ནི་རྫོགས་པར་འགྱུར། །
en: “Then they will perfect All the perfections and the grounds, The four types of fearlessness, the powers, And the major and minor marks.

source: སངས་རྒྱས་དེ་དག་རྣམས་ཀྱི་ནི། །གང་གི་ཞིང་དུ་འདོང་གྱུར་པ། །
en: “They will go to the field Of one of those buddhas.

source: དེ་ནི་བླ་མེད་ཡང་དག་རྫོགས། །བྱང་ཆུབ་རྟོགས་ནས་འཚང་རྒྱར་འགྱུར། །
en: They will realize unsurpassed, perfect, Complete awakening and become a buddha.

source: སྐྱེས་པ་ཡང་ན་བུད་མེད་གང་། །མཚན་རྣམས་འདི་དག་འཛིན་པ་ཡི། །ཡོན་ཏན་འདི་དང་གཞན་དག་ཀྱང་། །སངས་རྒྱས་བསྐལ་པ་རྒྱུན་དུ་གསུང་། །
en: “A buddha could describe These and the other qualities Of any man or woman Who bears these names in mind for an entire eon.

source: བག་ཡོད་ལྡན་པར་གྱུར་ནས་ནི། །ཡོན་ཏན་ཕུན་སུམ་འདི་ཐོས་ནས། །
en: “People who heed this teaching And learn about these excellent qualities

source: རྫོགས་པའི་སངས་རྒྱས་གྲགས་ལྡན་པ། །དེ་དག་མཚན་རྣམས་འཛིན་པར་འགྱུར། །
en: Should bear the names of these renowned Perfect buddhas in mind.

source: སངས་རྒྱས་འདི་དག་དཔལ་སྙིང་པོ། །སྤྲིན་གྱི་རྒྱལ་པོ་མི་ཡི་མཆོག །འཇིག་རྟེན་མགོན་པོ་འདི་དག་གི། །མཚན་ནི་བསྐལ་པར་གང་ཉན་པ། །
en: “Anyone who hears the names Of these buddhas who are glorious by nature, Who are world protectors, supreme among human beings, And celestial kings in the course of an eon,

source: གང་དག་འདི་རྣམས་མཚན་ཉན་ཅིང་། །ཐོས་ནས་གུས་པར་བྱེད་འགྱུར་བ། །
en: “And those who hear and learn their names Will be moved by devotion,

source: དེ་དང་དེ་དག་ཤེས་རབ་ཆེ། །རྐང་གཉིས་རྣམས་ཀྱི་མཆོག་ཏུ་འགྱུར། །
en: Will develop great insight into all things, And will become supreme among human beings.

source: དྲང་སྲོང་ཆེན་པོ་དེ་དག་གི། །འདི་འདྲའི་མཚན་དག་ཐོས་གྱུར་ན། །
en: Having learned the names of these great sages And

source: བག་ཡོད་ལྡན་ཞིང་མཁས་གྱུར་ལ། །ཤེས་རབ་ལྡན་པ་སུ་མི་འཛིན། །
en: heeded this teaching, “What wise, insightful person, Would not bear them in mind?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: After the Blessed One had spoken,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། དགེ་སློང་དེ་དག་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ།
en: the bodhisattva great being Maitreya, the entire retinue of monks and bodhisattvas, and the whole world with its gods, humans, asuras, and gandharvas were delighted and

source: བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ། །
en: praised his words.

source: འཕགས་པ་སངས་རྒྱས་བཅུ་གཉིས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །།
en: This concludes the noble Mahāyāna sūtra “ The Twelve Buddhas .”

source: !རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། དཱ་ན་ཤཱི་ལ་དང་། ཞུ་ཆེན་གྱི་ལོཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ། །
en: This text was translated and edited by the Indian teachers Jinamitra and Dānaśīla along with the chief editor and translator Bandé Yeshé Dé and then finalized. It was later revised according to the new language reform and then finalized.
